calumix/Chlorine_Sensor_Software/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t RTD_CH_SEL0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 2)  */
    GPIO_PinInit(BOARD_INITPINS_RTD_CH_SEL0_GPIO, BOARD_INITPINS_RTD_CH_SEL0_PORT, BOARD_INITPINS_RTD_CH_SEL0_PIN, &RTD_CH_SEL0_config);

    gpio_pin_config_t MEASURE_CSn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_MEASURE_CSn_GPIO, BOARD_INITPINS_MEASURE_CSn_PORT, BOARD_INITPINS_MEASURE_CSn_PIN, &MEASURE_CSn_config);

    gpio_pin_config_t VOLT_CURRn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_VOLT_CURRn_GPIO, BOARD_INITPINS_VOLT_CURRn_PORT, BOARD_INITPINS_VOLT_CURRn_PIN, &VOLT_CURRn_config);

    gpio_pin_config_t LED_ONn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 17)  */
    GPIO_PinInit(BOARD_INITPINS_LED_ONn_GPIO, BOARD_INITPINS_LED_ONn_PORT, BOARD_INITPINS_LED_ONn_PIN, &LED_ONn_config);

    gpio_pin_config_t BTN2n_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_BTN2n_GPIO, BOARD_INITPINS_BTN2n_PORT, BOARD_INITPINS_BTN2n_PIN, &BTN2n_config);

    gpio_pin_config_t RTD_CSn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_RTD_CSn_GPIO, BOARD_INITPINS_RTD_CSn_PORT, BOARD_INITPINS_RTD_CSn_PIN, &RTD_CSn_config);

    gpio_pin_config_t RTD_CH_SEL1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 58)  */
    GPIO_PinInit(BOARD_INITPINS_RTD_CH_SEL1_GPIO, BOARD_INITPINS_RTD_CH_SEL1_PORT, BOARD_INITPINS_RTD_CH_SEL1_PIN, &RTD_CH_SEL1_config);

    gpio_pin_config_t DBG_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 48)  */
    GPIO_PinInit(BOARD_INITPINS_DBG_GPIO, BOARD_INITPINS_DBG_PORT, BOARD_INITPINS_DBG_PIN, &DBG_config);

    gpio_pin_config_t MEASURE_CH_SEL1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 49)  */
    GPIO_PinInit(BOARD_INITPINS_MEASURE_CH_SEL1_GPIO, BOARD_INITPINS_MEASURE_CH_SEL1_PORT, BOARD_INITPINS_MEASURE_CH_SEL1_PIN, &MEASURE_CH_SEL1_config);

    gpio_pin_config_t MEASURE_CH_SEL0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 50)  */
    GPIO_PinInit(BOARD_INITPINS_MEASURE_CH_SEL0_GPIO, BOARD_INITPINS_MEASURE_CH_SEL0_PORT, BOARD_INITPINS_MEASURE_CH_SEL0_PIN, &MEASURE_CH_SEL0_config);

    gpio_pin_config_t RTD_REFn_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 12)  */
    GPIO_PinInit(BOARD_INITPINS_RTD_REFn_GPIO, BOARD_INITPINS_RTD_REFn_PORT, BOARD_INITPINS_RTD_REFn_PIN, &RTD_REFn_config);

    gpio_pin_config_t USB_POWERED_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_USB_POWERED_GPIO, BOARD_INITPINS_USB_POWERED_PORT, BOARD_INITPINS_USB_POWERED_PIN, &USB_POWERED_config);

    gpio_pin_config_t BTN1n_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 15)  */
    GPIO_PinInit(BOARD_INITPINS_BTN1n_GPIO, BOARD_INITPINS_BTN1n_PORT, BOARD_INITPINS_BTN1n_PIN, &BTN1n_config);

    IOCON->PIO[0][0] = ((IOCON->PIO[0][0] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT00 (pin 36) is configured as FC3_SCK. */
                        | IOCON_PIO_FUNC(PIO0_0_FUNC_ALT2)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO0_0_DIGIMODE_DIGITAL));

    IOCON->PIO[0][1] = ((IOCON->PIO[0][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT01 (pin 2) is configured as PIO0_1. */
                        | IOCON_PIO_FUNC(PIO0_1_FUNC_ALT0)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO0_1_DIGIMODE_DIGITAL));

    IOCON->PIO[0][10] = ((IOCON->PIO[0][10] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT010 (pin 13) is configured as SWO. */
                         | IOCON_PIO_FUNC(PIO0_10_FUNC_ALT6)

